//////////////////////////////////////////////////////////////////////////////////////////////////
//文件名  : IIRCoeffs.h
//描述    :  定义文件头文件
//当前版本: v1.0.0.0
//履历    :
//-------------------------
// 2017-08-03            模块创建                gxl
//

#ifndef __HH_IIRCOEFFS_H_HH__
#define __HH_IIRCOEFFS_H_HH__

//#include "DBG_DEF.h"

/* 分析频率为XHz(FX)时，各阶OnceFIR(SX)的滤波器系数个数、抽样点数 */
/************************S0: 采样频率102400Hz**************************************/
/********************0.16Hz,1Hz,2Hz,5Hz,10Hz,*****************/
#define SX_FX_REVERSCOEFFS_COMMON_NUM  (2)      
#define SX_FX_FORWARDCOEFFS_COMMON_NUM (3)

/* 分析频率为20Hz时，各阶IIR的滤波器系数个数、抽样点数 */
#define S0_F20_REVERSCOEFFS_NUM        (4)
#define S0_F20_FORWARDCOEFFS_NUM       (6)
/* 分析频率为50Hz时，各阶IIR的滤波器系数个数、抽样点数 */
#define S0_F50_REVERSCOEFFS_NUM        (4)
#define S0_F50_FORWARDCOEFFS_NUM       (6)

#define S0_F100_REVERSCOEFFS_NUM       (4)
#define S0_F100_FORWARDCOEFFS_NUM      (6)
/************************S0: 采样频率51200Hz**************************************/
/************************S1: 采样频率25600Hz**************************************/
/************************S2: 采样频率12800Hz**************************************/
/************************采样频率S3: 5120Hz**************************************/
/************************S4: 采样频率2560Hz**************************************/
/************************S5: 采样频率1280Hz**************************************/
#endif    /* __HH_IIRCOEFFS_H_HH__ */

